# API — Application Programming Interface — Программный интерфейс приложения
# Позволяет разным программам взаимодействовать друг с другом.
# Telegram Bot API позволяет управлять ботом через код.
#
# Handler — Обработчик
# Например, пользователь отправил /start — сработает нужный обработчик и бот ответит.
#
# Router — Маршрутизатор
# Группирует обработчики.
# Например, один Router отвечает за команды, другой — за меню, третий ≈ за работу с профилем.
#
# Filter — Фильтр
# Проверяет условие перед запуском обработчика.
# Например, проверяет, что пользователь отправил именно /start или текст Привет.
#
# Update — Обновление
# Событие, полученное ботом от Telegram.
# Это может быть сообщение, нажатие кнопки, изменение участника чата и другие события.
#
# Message — Сообщение
# Объект сообщения пользователя.
# Содержит текст, информацию об отправителе,чате и другие данные.
#
# Command — Команда
# Специальное сообщение, которое обычно начинается с /.
# # Примеры: /start, /help, /admin.
#
# Dispatcher               — Главный диспетчер, который принимает обновления и организует их обработку
# F / Magic Filter         — удобный способ проверять значения и свойства событий
# CommandStart()           — Фильтр команды /start
# Command("help")          — Фильтр команды /help
# F.text                   — Обращение к тексту сообщения через Magic Filter
# F.text == "Привет"       — Проверка, что текст сообщения точно равен Привет
# @router.message()        — Регистрация обработчика событий
# @router.callback_query() — Регистрация обработчика нажатий inline-кнопок
# async def                — Объявление асинхронной функции
# await                    — Ожидание результата асинхронной операции
# include_router()         — Подключение Router к Dispatcher или другому Route

# Project Bot — папка проекта
# config.py — настройки бота
# custom_filters.py — собственные фильтры
# main.py — запуск бота
# stats.py — статистика
# handlers — обработчики сообщений
# __init__.py — инициализация пакета
# admin.py — команды администратора
# common.py — основные команды
# fallback.py — обработка остальных сообщений
# games.py — игровые команды
# reactions.py — реакции на сообщения